Tekla.Structures.ModelInternal.BentPlateTestingTool
Wrapper class for bent plate farmi tests to hide OperationStatus in different versions (was BentPlateCreationStatus in 2016i and 2016iPRx).

Tekla.Structures.ModelInternal.BentPlateTestingTool.CreateByFaces(Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Point})
Creates and inserts a new Tekla.Structures.Model.BentPlate instance based on two parts and selected faces in each part.
part1: The first part.
face1: The selected face on the first part.
part2: The second part.
face2: The selected face on the second part.
Returns: The bent plate object if successful, null otherwise